Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: This function exists because normal script variables are not stored in the environment.
ja: 通常のスクリプト変数は環境に保存されないため、この機能が存在します。

source: This function fails and throws an exception under any of the following conditions:
ja: 以下のいずれかの条件下で、この関数は失敗し、例外をスローします：

source: This function first makes a brief attempt to close the window normally.
ja: この関数はまず、ウィンドウを普通に閉じようとします。

source: This function had a sort of wildcard name, allowing many different suffixes.
ja: この機能は、ワイルドカードのような名前で、さまざまな接尾辞をつけることができました。

source: This function has no effect on drives that do not support locking (such as most read-only drives).
ja: この機能は、ロックをサポートしないドライブ（ほとんどの読み取り専用ドライブなど）には影響しません。

source: This function has no effect when operating from within a compiled script.
ja: この機能は、コンパイルされたスクリプトの中から操作する場合には、何の効果もありません。

source: This function has no parameters.
ja: この関数にはパラメータがありません。

source: This function is commonly used for sort callbacks.
ja: この関数はソートコールバックによく使われる。

source: This function is equivalent to WinExist.
ja: この関数はWinExistと同等です。

source: This function is equivalent to selecting the "View->Variables" menu item in the main window.
ja: この機能は、メインウィンドウの「View->Variables」メニュー項目を選択することと同じです。

source: This function is equivalent to selecting the View->Hotkeys menu item in the main window.
ja: この関数はメインウィンドウのメニューで「表示」->「ホットキー」を選択するのと同じです。

source: This function is not intended for general use.
ja: 本機能は一般的な使用を想定していません。

source: This function is often used to create on-screen displays and other visual effects.
ja: この機能は、オンスクリーンディスプレイやその他のビジュアルエフェクトを作成するためによく使用される。

source: This function is only useful on Windows 64-bit.
ja: この機能は、Windows 64ビット版でのみ有効です。

source: This function is rarely used because the default behavior is best in most cases.
ja: ほとんどの場合、デフォルトの動作がベストであるため、この関数はほとんど使用されません。

source: This function is typically used to sort a variable that contains a list of lines, with each line ending in a linefeed character (`n).
ja: この関数は通常、行末が改行文字（`n）で終わる行のリストを含む変数をソートするために使われる。

source: This function is useful for scripts that are frequently changed.
ja: この機能は、頻繁に変更されるスクリプトに有効です。

source: This function is useful in cases where you have a collection of favorite windows that are almost always running.
ja: この機能は、ほぼ常時起動しているお気に入りのウィンドウが集まっているような場合に有効です。

source: This function is useful to avoid runtime errors when specifying a dynamic label for Goto.
ja: Gotoにダイナミックラベルを指定する際に、ランタイムエラーを回避するために有効な機能です。

source: This function literally sends keystrokes, to simulate typing or pressing of keys.
ja: この関数は文字通りキー入力を送信し、タイピングやキー押下をシミュレートする。

source: This function may permanently delete the file if it is too large to be recycled; also, a warning should be shown before this occurs.
ja: この関数は、ファイルが大きすぎてリサイクルできない場合、ファイルを永久に削除することがあります。

source: This function might use a large amount of RAM if the target control (e.g. an editor with a large document open) contains a large quantity of text.
ja: この関数は、ターゲットコントロール（例えば、大きな文書を開いているエディター）が大量のテキストを含んでいる場合、大量のRAMを使用する可能性があります。

source: This function might use a large amount of RAM if the target window (e.g. an editor with a large document open) contains a large quantity of text.
ja: この関数は、ターゲット・ウィンドウ（例えば、大きなドキュメントを開いているエディター）に大量のテキストが含まれている場合、大量のRAMを使用する可能性があります。

source: This function needs to be called multiple times if the drive was locked multiple times (at least for some drives).
ja: ドライブが複数回ロックされた場合、この関数を複数回呼び出す必要があります（少なくとも一部のドライブでは）。

source: This function operates only upon a single window except when WinTitle is ahk_group GroupName (with no other criteria specified), in which case all windows in the group are affected.
ja: ただし、WinTitleがahk_group GroupName（他の条件が指定されていない）の場合は、グループ内のすべてのウィンドウが対象となる。

source: This function operates only upon a single window except when WinTitle is ahk_group GroupName, in which case all windows in the group are affected.
ja: ただし、WinTitleがahk_group GroupNameの場合は、グループ内のすべてのウィンドウが対象となります。

source: This function operates only upon the topmost matching window except when WinTitle is ahk_group GroupName, in which case all windows in the group are affected.
ja: ただし、WinTitleがahk_group GroupNameのときは、グループ内のすべてのウィンドウが対象となります。

source: This function returns 0 (false) for unmuted or 1 (true) for muted.
ja: この関数は、ミュートされていないときに0 (false)を、ミュートされているときに1 (true)を返します。

source: This function returns 0 (false) if the function timed out or 1 (true) otherwise (i.e. the clipboard contains data).
ja: この関数は、タイムアウトした場合は0 (false)を、そうでない場合（すなわちクリップボードにデータがある場合）は1 (true)を返します。

source: This function returns 0 (false) if the function timed out or 1 (true) otherwise.
ja: この関数は、タイムアウトした場合は 0（偽）を、そうでない場合は 1（真）を返します。

source: This function returns 0 (not muted) or 1 (muted).
ja: この関数は0（ミュートされていない）または1（ミュートされている）を返す。

source: This function returns 1 (true) if BaseObj is in Value's chain of base objects, otherwise 0 (false).
ja: この関数は、BaseObj が Value のベースオブジェクトのチェーン内にある場合は 1 (true) を返し、それ以外の場合は 0 (false) を返します。

source: This function returns 1 (true) if Value is an object, otherwise 0 (false).
ja: この関数は、Valueがオブジェクトのときは1 (true)を返し、そうでないときは0 (false)を返します。

source: This function returns 1 (true) if Var or the variable represented by Ref has been assigned a value, otherwise 0 (false).
ja: この関数は VarまたはRef で表される変数に値が割り当てられていれば1 (true)を返し、そうでなければ0 (false)を返します。

source: This function returns 1 (true) if a match was found or 0 (false) if the function timed out.
ja: この関数は、マッチが見つかった場合は1 (true)を返し、タイムアウトした場合は0 (false)を返します。

source: This function returns 1 (true) if a method was found and passed validation (if performed), otherwise 0 (false).
ja: この関数は、メソッドが見つかって検証に合格したとき（実行されたとき）は1 (true)を返し、そうでないときは0 (false)を返します。

source: This function returns 1 (true) if the checkbox or radio button is checked, or 0 (false) if not.
ja: 説明： チェックボックスやラジオボタンがチェックされている場合は1（真）を、チェックされていない場合は0（偽）を返す。

source: This function returns 1 (true) if the color was found in the specified region, or 0 (false) if it was not found.
ja: この関数は、指定された領域で色が見つかった場合は 1（真）を、見つからなかった場合は 0（偽）を返します。

source: This function returns 1 (true) if the image was found in the specified region, or 0 (false) if it was not found.
ja: この関数は、指定された領域で画像が見つかった場合は 1（真）を、見つからなかった場合は 0（偽）を返します。

source: This function returns 1 (true) if the specified control is enabled, or 0 (false) if disabled.
ja: 指定された制御が有効な場合は1（真）を、無効な場合は0（偽）を返します。

source: This function returns 1 (true) if the specified control is visible, or 0 (false) if hidden.
ja: 説明： 指定されたコントロールが表示されている場合は 1（真）、非表示の場合は 0（偽）を返します。

source: This function returns 1 (true) if the specified label exists within the current scope, or 0 (false) if not.
ja: 指定されたラベルが現在のスコープ内に存在する場合は1（真）を、存在しない場合は0（偽）を返します。

source: This function returns 1 (true) if the specified label exists within the current scope, otherwise 0 (false).
ja: この関数は、指定したラベルが現在のスコープの中にあれば1（真）を、そうでなければ0（偽）を返します。

source: This function returns 1 (true) if the specified value is an object, or 0 (false) if not.
ja: 説明： 指定された値がオブジェクトである場合は1（真）を、そうでない場合は0（偽）を返す。

source: This function returns 1 (true) if the value has a property by this name, otherwise 0 (false).
ja: この関数は、値にこの名前のプロパティがあるときは1 (true)を返し、そうでないときは 0 (false)を返します。

source: This function returns EnvVar's value.
ja: この関数はEnvVarの値を返します。

source: This function returns a 64-bit signed integer.
ja: この関数は、64ビット符号付き整数を返します。

source: This function returns a bitmap or icon handle depending on whether a picture or icon is specified.
ja: この関数は、ピクチャまたはアイコンの指定に応じて、ビットマップまたはアイコンハンドルを返す。

source: This function returns a COM wrapper object of type dependent on the IID parameter.
ja: この関数は、IIDパラメータに依存するタイプのCOMラッパーオブジェクトを返します。

source: This function returns a ClipboardAll object, which has two properties (inherited from Buffer):
ja: この関数は、2つのプロパティ（Bufferから継承）を持つClipboardAllオブジェクトを返す：

source: This function returns a floating point number between 0.0 and 100.0.
ja: この関数は、0.0 から 100.0 までの浮動小数点数を返します。

source: This function returns a hexadecimal numeric string representing the RGB (red-green-blue) color of the pixel.
ja: 画素のRGB（赤緑青）色を16進数で表す文字列を返す関数です。

source: This function returns a list of items/rows.
ja: この関数は、項目／行のリストを返します。

source: This function returns a new COM wrapper object with the variant type VT_DISPATCH (9).
ja: この関数は、バリアントタイプVT_DISPATCH(9)を持つ新しいCOMラッパーオブジェクトを返します。

source: This function returns a number between 0 and 255 representing the degree of transparency of the specified window, where 0 indicates an invisible window and 255 indicates an opaque window.
ja: この関数は、指定されたウィンドウの透明度を表す0から255までの数を返します。0は不可視ウィンドウ、255は不透明ウィンドウを表します。

source: This function returns a number indicating the current state of the specified window:
ja: 指定されたウィンドウの現在の状態を示す数字を返します：

source: This function returns a pseudo-randomly generated number, which is a number that simulates a true random number but is really a number based on a complicated formula to make determination/guessing of the next number extremely difficult.
ja: この関数は、擬似乱数（本当の乱数を模した数値であるが、実際には次の数値の決定・推測を極めて困難にする複雑な計算式に基づいた数値）を返します。

source: This function returns a string of digits in the YYYYMMDDHH24MISS format.
ja: この関数は、YYYYMMDDHH24MISS形式の数字列を返します。

source: This function returns a value of the specified registry key.
ja: 説明： 指定されたレジストリキーの値を返します。

source: This function returns a version of Haystack whose contents have been replaced by the operation.
ja: この関数は、操作によって内容が置換されたバージョンのHaystackを返します。

source: This function returns a wrapper object containing a new SafeArray.
ja: この関数は、新しい SafeArray を含むラッパーオブジェクトを返します。

source: This function returns an array containing the substrings of the specified string.
ja: この関数は、指定された文字列の部分文字列を含む配列を返す。

source: This function returns an array containing the window handles (HWND) for all controls in the specified window.
ja: この関数は、指定されたウィンドウ内のすべてのコントロールのウィンドウハンドル（HWND）を含む配列を返す。

source: This function returns an array containing the window handles (HWND) of all existing windows that match the specified parameters.
ja: この関数は、指定されたパラメータに一致するすべての既存ウィンドウのウィンドウハンドル(HWND)を含む配列を返す。

source: This function returns an array containing the control names for all controls in the specified window.
ja: この関数は、指定されたウィンドウ内のすべてのコントロールのコントロール名を含む配列を返す。

source: This function returns an array containing the text of each item or row.
ja: この関数は、各項目または行のテキストを含む配列を返す。

source: This function returns an array of names for all controls in the specified window.
ja: この関数は、指定されたウィンドウの全てのコントロールの名前の配列を返します。

source: This function returns an array of unique ID numbers for all controls in the specified window.
ja: この関数は、指定したウィンドウ内の全てのコントロールのユニークなIDナンバーの配列を返します。

source: This function returns an array of unique ID numbers for all existing windows that match the specified criteria.
ja: この関数は、指定された条件に合致するすべてのウィンドウのID番号の配列を返します。

source: This function returns an array, where each element is an IPv4 address string such as "192.168.0.1".
ja: この関数は、各要素が「192.168.0.1」のようなIPv4アドレス文字列である配列を返す。

source: This function returns an object with the following properties:
ja: この関数は、以下のプロパティを持つオブジェクトを返します：

source: This function returns one of the following strings to represent which button the user pressed:
ja: この関数は、ユーザーがどのボタンを押したかを表すために、以下の文字列のいずれかを返します：

source: This function returns only the IP addresses of the computer's network adapters.
ja: この関数は、コンピュータのネットワーク・アダプターのIPアドレスのみを返す。

source: This function returns the Gui object associated with the specified HWND, or an empty string if there isn't one or the HWND is invalid.
ja: この関数は、指定された HWND に関連付けられたGui オブジェクト、または、HWND が存在しないか無効な場合は空文字列を返します。

source: This function returns the GuiControl object associated with the specified HWND, or an empty string if there isn't one or the HWND is invalid.
ja: この関数は、指定された HWND に関連付けられたGuiControl オブジェクト、または、存在しないか HWND が無効である場合は空文字列を返します。

source: This function returns the HWND (unique ID) of a matching window if one was found, or 0 if the function timed out.
ja: この関数は、一致するウィンドウが見つかればそのHWND（ユニークID）を返し、タイムアウトした場合は0を返す。

source: This function returns the HWND (unique ID) of the window selected for activation, or 0 if no matching windows were found to activate.
ja: この関数は、アクティブ化するために選択されたウィンドウのHWND（ユニークID）を返し、アクティブ化するために一致するウィンドウが見つからなかった場合は0を返します。

source: This function returns the Process ID (PID) of the specified process.
ja: 説明： 指定されたプロセスのプロセスID（PID）を返します。

source: This function returns the Process ID (PID) of the specified window.
ja: 指定されたプロセスのプロセスID（PID）を返します。

source: This function returns the class name of the specified window.
ja: この関数は、指定されたウィンドウのクラス名を返します。

source: This function returns the unique ID (HWND) of the active window if it matches the specified criteria, or 0 if it does not.
ja: この関数は、アクティブウィンドウが指定された条件に一致するときはそのユニークID（HWND）を返し、一致しないときは0を返します。

source: This function returns the unique ID (HWND) of the first matching window (or 0 if none).
ja: この関数は、最初にマッチしたウィンドウのユニークID（HWND）を返す（何もなければ0）。

source: This function returns the window handle (HWND) of the focused control.
ja: 説明： フォーカスされているコントロールのウィンドウハンドル（HWND）を返します。

source: This function returns the window handle (HWND) of the last/bottommost window if there is more than one match.
ja: 一致するウィンドウが複数あるときは、この関数は最後または一番下のウィンドウのウィンドウハンドル（HWND）を返します。

source: This function returns the window handle (HWND) of the specified control.
ja: 説明： 指定されたコントロールのウィンドウハンドル(HWND)を返す。

source: This function returns the window handle (HWND) of the specified window.
ja: この関数は、指定されたウィンドウのウィンドウハンドル（HWND）を返します。

source: This function returns the Drive's media status:
ja: この関数は、ドライブのメディアステータスを返します：

source: This function returns the Drive's volume label.
ja: この関数はDriveのボリュームラベルを返します。

source: This function returns the Drive's volume serial number.
ja: この関数はドライブのボリュームシリアルナンバーを返します。

source: This function returns the ClassNN (class name and sequence number) of the specified control.
ja: 説明： 指定されたコントロールの ClassNN（クラス名とシーケンス番号）を返す。

source: This function returns the actual value of the specified key.
ja: この関数は、指定されたキーの実際の値を返します。

source: This function returns the address to the right of the last item written.
ja: この関数は、最後に書き込まれた項目の右側のアドレスを返します。

source: This function returns the attributes of the file or folder.
ja: この関数は、ファイルまたはフォルダの属性を返します。

source: This function returns the attributes of the first matching file or folder.
ja: この関数は、最初にマッチしたファイルまたはフォルダの属性を返します。

source: This function returns the attributes of the first matching folder.
ja: この関数は、最初にマッチしたフォルダの属性を返します。

source: This function returns the binary number at the specified address+offset.
ja: この関数は、指定されたアドレス＋オフセットにある2進数を返します。

source: This function returns the class name of Value.
ja: この関数は、Valueのクラス名を返します。

source: This function returns the column number in an Edit control where the caret (text insertion point) resides.
ja: 説明： キャレット（テキスト挿入点）が存在するエディットコントロールのカラム番号を返します。

source: This function returns the contents of the specified file.
ja: 説明： 指定されたファイルの内容を返します。

source: This function returns the copied or converted string.
ja: この関数は、コピーまたは変換された文字列を返す。

source: This function returns the current flags of the specified COM object (after applying NewFlags, if specified).
ja: この関数は、指定された COM オブジェクトの現在のフラグ（指定された場合、NewFlagsを適用した後）を返します。

source: This function returns the current memory address of Value.
ja: この関数は、Valueの現在のメモリアドレスを返す。

source: This function returns the current state of the specified window:
ja: この関数は、指定されたウィンドウの現在の状態を返します：

source: This function returns the difference between the two timestamps, in the units specified by TimeUnits.
ja: 説明： 2つのタイムスタンプの差をTimeUnitsで指定された単位で返す。

source: This function returns the drive letters in the system, depending on DriveType.
ja: この関数は、ドライブのタイプに応じたシステム内のドライブレターを返します。

source: This function returns the drive letters in the system, depending on the specified type.
ja: この関数は、指定されたタイプに応じて、システム内のドライブレターを返します。

source: This function returns the entry number of a ListBox or ComboBox that is a complete match for String.
ja: この関数は、Stringに完全に一致するListBoxまたはComboBoxのエントリ番号を返します。

source: This function returns the formatted version of the specified string.
ja: この関数は、指定された文字列を整形したものを返す。

source: This function returns the free disk space of the drive which contains Path, in megabytes (rounded down to the nearest megabyte).
ja: この関数は、指定された パス,を含むドライブの空きディスク容量をメガバイト単位で返します（メガバイト未満は切り捨て）。

source: This function returns the free disk space of the drive which contains the specified path, in megabytes (rounded down to the nearest megabyte).
ja: この関数は、指定されたパスを含むドライブの空きディスク容量をメガバイト単位で返す（メガバイト未満は切り捨て）。

source: This function returns the full path and name of the folder chosen by the user.
ja: この関数は、ユーザーが選択したフォルダのフルパスと名前を返します。

source: This function returns the full path and name of the process that owns the specified window.
ja: この関数は、指定されたウィンドウを所有するプロセスのフルパスと名前を返します。

source: This function returns the function object which contains the implementation of the method, or Value itself if Name was omitted.
ja: この関数は、メソッドの実装を含む関数オブジェクト、またはNameが省略された場合はValue自体を返す。

source: This function returns the index of the chosen item, where 1 is the first item, 2 is the second, etc.
ja: この関数は、選ばれた項目のインデックスを返します。1 は最初の項目、2 は 2 番目の項目、といった具合です。

source: This function returns the index of the currently selected entry or tab.
ja: この関数は、現在選択されている項目またはタブのインデックスを返す。

source: This function returns the index of the new item, where 1 is the first item, 2 is the second, etc.
ja: この関数は、新しい項目のインデックスを返します。1が最初の項目、2が2番目の項目、といった具合です。

source: This function returns the length of the specified string.
ja: この関数は、指定された文字列の長さを返します。

source: This function returns the line number in an Edit control where the caret (text insertion point) resides.
ja: この関数は、エディットコントロールのキャレット（テキスト挿入点）が存在する行番号を返します。

source: This function returns the media status of the specified CD/DVD drive:
ja: 説明： 指定された CD/DVD ドライブのメディアステータスを返す：

source: This function returns the monitor number (the same as N unless N was omitted).
ja: この関数は、モニター番号を返します（Nが省略されない限り、Nと同じです）。

source: This function returns the name of the currently selected entry in a ListBox or ComboBox.
ja: 説明： ListBoxまたはComboBoxで現在選択されている項目の名前を返します。

source: This function returns the name of the device or component, which can be empty.
ja: この関数は、デバイス名またはコンポーネント名を返しますが、空のときもあります。

source: This function returns the name of the process that owns the specified window.
ja: この関数は、指定されたウィンドウを所有するプロセスの名前を返します。

source: This function returns the name of the specified key, or blank if the key is invalid or unnamed.
ja: この関数は、指定されたキーの名前を返します。キーが無効または名前がないときは、空白を返します。

source: This function returns the number of characters that TargetVar can now hold, which will be greater than or equal to RequestedCapacity.
ja: この関数は、TargetVarが現在保持できる文字数を返し、これはRequestedCapacity以上となる。

source: This function returns the number of characters that Var can now hold, which will be greater than or equal to RequestedCapacity.
ja: この関数は、Varが現在保持できる文字数を返し、これはRequestedCapacity以上となる。

source: This function returns the number of existing windows that match the specified criteria.
ja: この関数は、指定した条件に合致するウィンドウの数を返します。

source: This function returns the number of existing windows that match the specified parameters.
ja: この関数は、指定されたパラメータに一致する既存のウィンドウの数を返す。

source: This function returns the number of lines in an Edit control.
ja: この関数は、Editコントロールの行数を返します。

source: This function returns the number of the primary monitor.
ja: この関数は、プライマリモニタの番号を返します。

source: This function returns the operating system's name for the specified monitor.
ja: この関数は、指定されたモニターのオペレーティングシステム名を返します。

source: This function returns the ordinal value (numeric character code) of the first character in the specified string.
ja: 説明： 指定された文字列の最初の文字の序列値（数値文字コード）を返します。

source: This function returns the ordinal value of String, or 0 if String is empty.
ja: この関数は、Stringの序数値を返し、Stringが空の場合は0を返します。

source: This function returns the position of an occurrence of the string Needle in the string Haystack.
ja: この関数は、文字列Haystackの中で文字列Needleが出現する位置を返します。

source: This function returns the position of the leftmost occurrence of NeedleRegEx in the string Haystack.
ja: この関数は、文字列Haystackの中でNeedleRegExが最も左側に出現する位置を返します。

source: This function returns the previous setting (the value A_IsCritical would return prior to calling the function).
ja: この関数は、以前の設定値（この関数を呼び出す前にA_IsCriticalが返していた値）を返します。

source: This function returns the previous setting.
ja: 前の設定に戻す機能です。

source: This function returns the previous setting; either 0 (false) or 1 (true).
ja: この関数は、前の設定を返します。0 (false)または1 (true)のいずれかです。

source: This function returns the previous setting; either 32, 64 or Default.
ja: この関数は、前の設定を返します。32、64またはDefaultのいずれかです。

source: This function returns the previous setting; either Screen, Window or Client.
ja: この関数は、前の設定を返します。Screen、Window、または Client のいずれかです。

source: This function returns the previous value of the global setting; either 0 (false, the default value) or 1 (true).
ja: この関数は、グローバル設定の前の値（0（デフォルト値である偽）または1（真））を返します。

source: This function returns the previous value of whichever setting was changed (either A_TitleMatchMode or A_TitleMatchModeSpeed).
ja: この関数は、変更前の値（A_TitleMatchModeまたはA_TitleMatchModeSpeed）を返します。

source: This function returns the process ID (PID) of the process which created the specified process.
ja: 説明： 指定されたプロセスを作成したプロセスのプロセス ID（PID）を返します。

source: This function returns the process name of the specified window.
ja: この関数は、指定されたウィンドウのプロセス名を返します。

source: This function returns the replaced version of the specified string.
ja: この関数は、指定された文字列の置換されたバージョンを返す。

source: This function returns the requested substring of the specified string.
ja: この関数は、指定された文字列の、要求された部分文字列を返します。

source: This function returns the result of converting Value to a pure floating-point number (having the type name "Float"), or Value itself if it is already the correct type.
ja: この関数は、Valueを純粋な浮動小数点数（型名「Float」）に変換した結果、またはValueが既に正しい型である場合はE2自身を返す。

source: This function returns the result of converting Value to a pure integer (having the type name "Integer"), or Value itself if it is already the correct type.
ja: この関数は、Valueを純粋な整数（型名「Integer」）に変換した結果、またはValueが、すでに正しい型である場合はそれ自体を返します。

source: This function returns the result of converting Value to a pure integer or floating-point number, or Value itself if it is already an Integer or Float value.
ja: この関数は、Valueを純粋な整数または浮動小数点数に変換した結果、または既にIntegerまたはFloat値である場合はValue自身を返します。

source: This function returns the result of converting Value to a string, or Value itself if it is a string.
ja: この関数は、Valueを文字列に変換した結果、またはValueが文字列の場合はValueそのものを返します。

source: This function returns the result of the message, which might sometimes be a "reply" depending on the nature of the message and its target window.
ja: この関数はメッセージの結果を返します。メッセージの性質やターゲットウィンドウによっては、「返信」となる場合があります。

source: This function returns the scan code of the specified key, or 0 if the key is invalid or has no scan code.
ja: この関数は、指定されたキーのスキャンコードを返し、キーが無効であるかスキャンコードがない場合は0を返します。

source: This function returns the selected text in an Edit control.
ja: この関数は、Edit コントロールで選択されているテキストを返します。

source: This function returns the six-digit RGB color such as 0x00CC99 that is marked transparent in the specified window (see WinSetTransColor for how to set the TransColor).
ja: この関数は、指定されたウィンドウで透明と表示されている 0x00CC99 のような 6 桁の RGB カラーを返します（TransColor の設定方法についてはWinSetTransColorを参照してください）。

source: This function returns the six-digit RGB color such as 0x00CC99 that is marked transparent in the specified window.
ja: この関数は、指定されたウィンドウで透明と表示されている 0x00CC99 のような 6 桁の RGB カラーを返します。

source: This function returns the size of the specified file (rounded down to the nearest whole number).
ja: 説明： 指定されたファイルのサイズを返します（小数点以下は切り捨て）。

source: This function returns the sorted version of the specified string.
ja: この関数は、指定された文字列をソートして返します。

source: This function returns the status of the drive which contains Path:
ja: この関数は、パスを含むドライブのステータスを返します：

source: This function returns the status of the drive which contains the specified path:
ja: 説明： 指定されたパスが含まれるドライブの状態を返す：
